Revit 2027 API
BarTypeDiameterOptions.StandardBendDiameter Property
 Represents the standard bar bend diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StandardBendDiameter { get; set; }
Public Property StandardBendDiameter As Double
	Get
	Set
public:
property double StandardBendDiameter {
	double get ();
	void set (double value);
}
member StandardBendDiameter : float with get, set
Property Value
Double
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace